UNFCOPY.саУНФУправлениеАссортиментом/src/DataProcessors/ПечатьГарантийногоТалона/ПечатьГарантийногоТалона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьГарантийногоТалона</name>
</mdclass:DataProcessor>

UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bea7f781-5f18-4219-997c-9a767fb284be">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="c714b2ec-44f0-4d97-9f0f-b2917a0fd654">
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="943e74c4-655a-4b9c-b82e-7e5efda13c74">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c5e9b842-544a-44f2-ab17-9f8914c321c7">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a74696bf-5501-4ca5-88cb-7bfa51d5ba5c">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="684049cc-bea4-46ee-b11f-a71286339275">
    <name>КатегорияНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29ee8eb2-cd83-4cc1-b40d-4e152378ea5c">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f21ff321-715f-4a5b-944b-2b848961de15">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b6172ca7-1aac-4ae9-923c-78be3ad52817">
    <name>Длина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="25d2b654-7af2-4ff9-9565-690f90e3301d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1272ae5d-3d76-41d7-8089-96b9d0e2171d">
    <name>МетодОценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c14397a9-756b-499c-a0cb-dffb36b39d37">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a820996-d36c-4681-a90e-8bddd53206e6">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a4fec3ac-4e1d-4920-a364-ed3b4ea7789d">
    <name>ПроверятьЗаполнениеПартий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2422f318-d2d7-4825-8a73-3422fb7c9b76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9ae7ccb-58d3-4b59-908e-f8ae3990cdf5">
    <name>СчетУчетаДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4366f2f7-ebc2-41cc-b496-b7c9db977701">
    <name>СчетУчетаЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fecab396-8b88-44fa-b328-6a0a2920dfc4">
    <name>СчетУчетаЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="142f8ba7-a38b-4348-9c20-d7d426b19366">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="27d64301-1b5e-4ac9-82b2-fc31566ecc01">
    <name>ВидСтавкиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9ee9a54f-4c2c-4fe3-b88f-73e8003f88a0">
    <name>Ширина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="10add62f-df6c-44d4-a086-eb92ce5f478b">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="329a9d17-e027-4bae-8fc7-744dd587d5c4">
    <name>ИспользоватьПартии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="bd8e047b-adf8-40d6-bb50-46e0d3ab9614">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="00672e15-008c-49f6-89d3-d71ec5d4df3c">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="515c5b7e-2abb-4a33-9d4b-3bebd39ff5d5">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ada8c4c4-e2e3-494b-9651-3a2ffce216d8">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/DataProcessors/ПечатьГарантийногоТалона/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПредставлениеПФ()  Экспорт
		Возврат НСтр("ru = 'Гарантийный талон'");		
КонецФункции

Функция КлючПараметровПечати()  Экспорт
	Возврат "ПАРАМЕТРЫ_ПЕЧАТИ_ГарантийныйТалонФЛ";
КонецФункции

Функция ПолныйПутьКМакету() Экспорт
	Возврат "Обработка.ПечатьГарантийногоТалона.ПФ_MXL_ГарантийныйТалонФЛ";
КонецФункции

Функция ИдентификаторПечатнойФормы() Экспорт
	
	Возврат  "ГарантийныйТалонФЛ";
	
КонецФункции

Функция ДанныеЛистаЗагрузки(МассивОбъектов)
	
	ТекущийДокумент = МассивОбъектов[0];	
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	саУНФГарантийныеТалоны.Документ КАК Документ,
		|   саУНФГарантийныеТалоны.Документ.Дата КАК Дата,
		|	саУНФГарантийныеТалоны.Документ.Организация.Представление КАК ОрганизацияПредставление,
		|   саУНФГарантийныеТалоны.Документ.Организация КАК Организация,
		|   саУНФГарантийныеТалоны.Документ.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиница,
		|	саУНФГарантийныеТалоны.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
		|	саУНФГарантийныеТалоны.Номенклатура.Вес КАК Масса,
		|	саУНФГарантийныеТалоны.Номер КАК Номер,
		|   ПОДСТРОКА(саУНФГарантийныеТалоны.Номер, 17, 2) КАК НомерСтроки,
		|	саУНФГарантийныеТалоны.Номенклатура КАК Номенклатура,
		|	саУНФГарантийныеТалоны.Автомобиль Автомобиль,
		| 	саУНФГарантийныеТалоны.ГодВыпускаАвтомобиля ГодВыпускаАвтомобиля,		
		|	саУНФГарантийныеТалоны.СерийныйНомер СерийныйНомер,
		|	саУНФГарантийныеТалоны.Пробег Пробег,
		|	саУНФГарантийныеТалоны.ОбъемДвигателя ОбъемДвигателя,
		|	саУНФГарантийныеТалоны.СрокГарантии СрокГарантии,
		|	саУНФГарантийныеТалоны.ГодИзготовленияБатареи ГодИзготовленияБатареи, 
		|	саУНФГарантийныеТалоны.ТипДвигателя ТипДвигателя,
		|	саУНФГарантийныеТалоны.НапряжениеЭДС НапряжениеЭДС,
		|	саУНФГарантийныеТалоны.НапряжениеПодНагрузкой НапряжениеПодНагрузкой
		|ИЗ
		|	РегистрСведений.саУНФГарантийныеТалоны КАК саУНФГарантийныеТалоны
		|ГДЕ
		|	саУНФГарантийныеТалоны.Документ = &Документ";
		
		Запрос.УстановитьПараметр("Документ", ТекущийДокумент);
		РезультатГарантийныеТалоны = Запрос.Выполнить();
		
		Если РезультатГарантийныеТалоны.Пустой() Тогда
			Возврат Неопределено;
		КонецЕсли;
	

	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПокупателяЗапасы.Номенклатура,
		|	ЗаказПокупателяЗапасы.Количество,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяЗапасы.Количество = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.Всего / ЗаказПокупателяЗапасы.Количество КАК ЧИСЛО(10, 2))
		|	КОНЕЦ КАК Цена,
		|	ЗаказПокупателяЗапасы.НомерСтроки,
		|	ЗаказПокупателяЗапасы.Номенклатура.КатегорияНоменклатуры
		|ПОМЕСТИТЬ ВТ_ЗАПАСЫ
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|ГДЕ
		|	ЗаказПокупателяЗапасы.Ссылка = &Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	саУНФ_НастройкиСЦ.КатегорияНоменклатуры
		|ПОМЕСТИТЬ ВТ_КАТ
		|ИЗ
		|	РегистрСведений.саУНФ_НастройкиСЦ КАК саУНФ_НастройкиСЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗАПАСЫ.Номенклатура,
		|	ВТ_ЗАПАСЫ.Количество,
		|	ВТ_ЗАПАСЫ.Цена,
		|	ВТ_ЗАПАСЫ.НомерСтроки
		|ПОМЕСТИТЬ ВТ_ДОККАТ
		|ИЗ
		|	ВТ_КАТ КАК ВТ_КАТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗАПАСЫ КАК ВТ_ЗАПАСЫ
		|		ПО ВТ_ЗАПАСЫ.НоменклатураКатегорияНоменклатуры = ВТ_КАТ.КатегорияНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеРеквизитыИСведения.Ссылка КАК СвойствоХариктеристик
		|ПОМЕСТИТЬ ВТ_ХАРАКТЕРИСТИКИ
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		|ГДЕ
		|	ДополнительныеРеквизитыИСведения.Имя = ""Производитель_ab2fcb4294e940bdb2d4605fb51575d5""
		|	ИЛИ ДополнительныеРеквизитыИСведения.Имя = ""Емкость_c115668b3358438b97fe48f9b7f8f281""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДОККАТ.Номенклатура
		|ПОМЕСТИТЬ ВТ_НОМ
		|ИЗ
		|	ВТ_ДОККАТ КАК ВТ_ДОККАТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НОМ.Номенклатура,
		|	НоменклатураДополнительныеРеквизиты.Свойство,
		|	НоменклатураДополнительныеРеквизиты.Значение,
		|	НоменклатураДополнительныеРеквизиты.ТекстоваяСтрока,
		|	ВТ_ХАРАКТЕРИСТИКИ.СвойствоХариктеристик.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НОМ КАК ВТ_НОМ
		|		ПО ВТ_НОМ.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ХАРАКТЕРИСТИКИ КАК ВТ_ХАРАКТЕРИСТИКИ
		|		ПО НоменклатураДополнительныеРеквизиты.Свойство = ВТ_ХАРАКТЕРИСТИКИ.СвойствоХариктеристик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДОККАТ.Номенклатура,
		|	ВТ_ДОККАТ.Количество,
		|	ВТ_ДОККАТ.Цена,
		|	ВТ_ДОККАТ.НомерСтроки
		|ИЗ
		|	ВТ_ДОККАТ КАК ВТ_ДОККАТ";
	
	Запрос.УстановитьПараметр("Документ", ТекущийДокумент);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаДопСведенияНом = РезультатЗапроса[5].Выгрузить();	
	ТаблицаТабЧасть = РезультатЗапроса[6].Выгрузить();
	
	СтруктураОтвета = Новый Структура("РезультатГарантийныеТалоны,ТаблицаДопСведенияНом,ТаблицаТабЧасть",
	РезультатГарантийныеТалоны,ТаблицаДопСведенияНом,ТаблицаТабЧасть);
	
	Возврат  СтруктураОтвета;
	

КонецФункции // ()
 
Функция ДанныеПользователя()
 	Продавец = "";
 	МассивСотрудников =УправлениеНебольшойФирмойСервер.ПолучитьСотрудниковПользователя(Пользователи.ТекущийПользователь());
 	Если ТипЗнч(МассивСотрудников)=Тип("Массив") И МассивСотрудников.Количество()>0 Тогда
			Сотрудник = МассивСотрудников[0];
			ИмяСотрудника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "Наименование");
			Продавец = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ИмяСотрудника);
 	КонецЕсли;
 	Возврат Продавец;		
 КонецФункции


Функция СформироватьПФ(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати) Экспорт
	СтруктураОтвета = ДанныеЛистаЗагрузки(МассивОбъектов);
	ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
	Если СтруктураОтвета = Неопределено Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
	ПолныйПутьКМакету	=	ПечатнаяФорма.ПолныйПутьКМакету;
	ПервыйДокумент = Истина;

	Макет = УправлениеПечатью.МакетПечатнойФормы(ПолныйПутьКМакету);
	РезультатГарантийныеТалоны 	=  	СтруктураОтвета.РезультатГарантийныеТалоны;
	ТаблицаДопСведенияНом 		= 	СтруктураОтвета.ТаблицаДопСведенияНом;
	ТаблицаТабЧасть				=	СтруктураОтвета.ТаблицаТабЧасть;
	ВыборкаДокументов 			= 	РезультатГарантийныеТалоны.Выбрать();
	ВыборкаДокументов.Следующий();
	Продавец					=	ДанныеПользователя();
	АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
																				   ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации"));
	Местопродажи = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.СтруктурнаяЕдиница,
																			   ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы"));
	Организация = 	ВыборкаДокументов.ОрганизацияПредставление + " " + АдресОрганизации;
    ДатаПродажи = ФОРМАТ(ВыборкаДокументов.Дата,"ДФ=dd.MM.yyyy;");
	ВыборкаДокументов.Сбросить();
	Пока ВыборкаДокументов.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		СтруктураПараметров = Новый Структура;

		СтруктураОтбора = Новый Структура("Номенклатура", ВыборкаДокументов.Номенклатура);
		Емкость="";
		Производитель="";
		Если ТаблицаДопСведенияНом.Количество() > 0 Тогда
			МассивДопСведенияНом = ТаблицаДопСведенияНом.НайтиСтроки(СтруктураОтбора);
			Если МассивДопСведенияНом.Количество() > 0 Тогда
				Для Каждого СтрМас Из МассивДопСведенияНом Цикл
					ИмяПараметра = СокрЛП(НРЕГ(СтрМас.Наименование));
					Если ИмяПараметра = "емкость" Тогда
						Емкость=СтрМас.Значение;
					КонецЕсли;
					Если ИмяПараметра = "производитель" Тогда
						Производитель=СтрМас.Значение;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

		ГодВыпускаАвтомобиля = ?(ВыборкаДокументов.ГодВыпускаАвтомобиля > 0, "год выпуска: "
																			 + Формат(ВыборкаДокументов.ГодВыпускаАвтомобиля,
																					  "ЧГ=0"), "-");
		Пробег = ?(ВыборкаДокументов.Пробег > 0, Формат(ВыборкаДокументов.Пробег, "ЧГ=0") + " км.", "-");
		ОбъемДвигателя = ?(ВыборкаДокументов.ОбъемДвигателя > 0, Формат(ВыборкаДокументов.ОбъемДвигателя, "ЧГ=0")
																 + " см3", "");

		Цена = 0;
		МассивНом = ТаблицаТабЧасть.НайтиСтроки(СтруктураОтбора);
		Если МассивНом.Количество() > 0 Тогда
			Цена = МассивНом[0].Цена;
			Если МассивНом.Количество() > 1 Тогда
				Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ВыборкаДокументов.НомерСтроки) Тогда
					НомерСтроки = Число(ВыборкаДокументов.НомерСтроки);
					Для Каждого СтрМасс Из МассивНом Цикл
						Если СтрМасс.НомерСтроки = НомерСтроки Тогда
							Цена = СтрМасс.Цена;
						КонецЕсли;
					КонецЦикла;

				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		СтруктураПараметров.Вставить("Продавец", Продавец);
		СтруктураПараметров.Вставить("Емкость", Емкость);
		СтруктураПараметров.Вставить("Производитель", Производитель);
		СтруктураПараметров.Вставить("Организация", Организация);
		СтруктураПараметров.Вставить("Местопродажи", Местопродажи);
		СтруктураПараметров.Вставить("Цена", Цена);
		СтруктураПараметров.Вставить("ГодВыпускаАвтомобиля", ГодВыпускаАвтомобиля);
		СтруктураПараметров.Вставить("Пробег", Пробег);
		СтруктураПараметров.Вставить("ОбъемДвигателя", ОбъемДвигателя);
		СтруктураПараметров.Вставить("ДатаПродажи", ДатаПродажи);

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);

		ТабличныйДокумент.Вывести(ОбластьМакета);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ТабличныйДокумент.АвтоМасштаб = Истина;

		ТабличныйДокумент.ПолеСверху = 2;
		ТабличныйДокумент.ПолеСнизу = 1;

		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	КонецЦикла;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;

КонецФункции

#КонецЕсли
